sdaiPutADBTypePath(Sdai_ADBId*,System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst**)
\details
Specifies the type path for an attribute data block (ADB).
The type path consists of an array of strings that defines the path in the nested SELECT types hierarchy.
\param block          [in] An attribute data block (ADB) instance.
\param typeNameNumber [in] A size of the string array that defines the path.
\param typeNameVector [in] A string array with the path.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiVA_NVLD - Value invalid.
* sdaiVT_NVLD - Value type invalid.
* sdaiAB_NEXS - ADB does not exist.
* sdaiSY_ERR - Underlying system error.
\code
SdaiADB adbIfcUnit = sdaiCreateEmptyADB();
SdaiString typePath[] = { "IfcNamedUnit" };
sdaiPutADBTypePath(adbIfcUnit, 1, typePath);